In [1]:
# Create a list
a = [50, 60, 70, 80]
a

[50, 60, 70, 80]

In [2]:
# Create a tuple
b = ('Mark', 16, 54.11)
b

('Mark', 16, 54.11)

In [3]:
# Create an array
import numpy as np

c = np.array([50, 60, 70, 80])
c

array([50, 60, 70, 80])

In [4]:
# Create two sets
d = {50, 60, 70, 60, 60, 50}
d

{50, 60, 70}

In [5]:
e = {70, 50, 60, 50}
e

{50, 60, 70}

In [6]:
d == e

True

In [7]:
# Create a dictionary
students = {'Mark': 30, 'David': 25, 'Mary': 28}
students

{'Mark': 30, 'David': 25, 'Mary': 28}

In [8]:
students['Mark'] = 28
students

{'Mark': 28, 'David': 25, 'Mary': 28}

In [9]:
# Create a Pandas Series
import pandas as pd

grades = pd.Series([87, 100, 94])
grades

0     87
1    100
2     94
dtype: int64

In [10]:
grades.mean()

93.66666666666667

In [11]:
grades.std()

6.506407098647712

In [12]:
grades.describe()

count      3.000000
mean      93.666667
std        6.506407
min       87.000000
25%       90.500000
50%       94.000000
75%       97.000000
max      100.000000
dtype: float64

In [13]:
# Customize the indices
grades = pd.Series({'Wally': 87, 'Eva':100, 'Sam': 94})
grades

Wally     87
Eva      100
Sam       94
dtype: int64

In [14]:
grades['Wally'] = 90
grades

Wally     90
Eva      100
Sam       94
dtype: int64

In [15]:
# Create a DataFrame from a dictionary
grades_dict = {'Wally': [87, 90, 70],
              'Eva': [100, 87, 90],
              'Sam': [94, 77, 90]}
grades_dict

{'Wally': [87, 90, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90]}

In [16]:
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam
0     87  100   94
1     90   87   77
2     70   90   90

In [17]:
# Select a column as a Series
grades['Wally']

0    87
1    90
2    70
Name: Wally, dtype: int64

In [18]:
# Select a column as a DataFrame
grades[['Wally']]

   Wally
0     87
1     90
2     70

In [19]:
# Extract two columns from a DataFrame
grades[['Wally', 'Sam']]

   Wally  Sam
0     87   94
1     90   77
2     70   90

In [20]:
grades.describe()

           Wally         Eva        Sam
count   3.000000    3.000000   3.000000
mean   82.333333   92.333333  87.000000
std    10.785793    6.806859   8.888194
min    70.000000   87.000000  77.000000
25%    78.500000   88.500000  83.500000
50%    87.000000   90.000000  90.000000
75%    88.500000   95.000000  92.000000
max    90.000000  100.000000  94.000000